app/views/questions/_form.html.erb


  idea = Idea.find(idea_id)
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 18) LIMIT 1