app/views/questions/new.html.erb

SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 18) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  <h1>Ask Question</h1>
  <% if Idea.find(params[:idea_id]).user.id == current_user.id %>