app/views/ideas/show.html.erb


      <% milestones = Milestone.where(:idea_id => @idea.id).each do |m| %>
---
SELECT "milestones".* FROM "milestones" WHERE ("milestones"."idea_id" = 18)

            <%= link_to voteup_path(@idea) do  %>
              <img src='/images/ico_voteup.png' /> <%= pluralize(Rating.where(:rating_type => 1, :idea_id => @idea).count, "Vote") %> Up
---
SELECT COUNT(*) FROM "ratings" WHERE ("ratings"."rating_type" = 2) AND ("ratings"."idea_id" = 18)

            <%= link_to add_my_favorite_path(@idea) do  %>
              <img src='/images/ico_favorite.png' /> <%= pluralize(@idea.favorites.count, "Favorite") %>
---
SELECT COUNT(*) FROM "favorites" WHERE ("favorites".idea_id = 18)

            <%= link_to idea_path(@idea) do  %>
              <img src='/images/ico_stats.png' /> <%= pluralize(@idea.views.count, "View")%>
---
SELECT COUNT(*) FROM "views" WHERE ("views".idea_id = 18)

      <ul>
        <% questions = Question.where(:idea_id => @idea.id).each do |q| %>
---
SELECT "questions".* FROM "questions" WHERE ("questions"."idea_id" = 18)