app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites"
---
  def index
    @favorites = Favorite.all

SELECT "favorites".* FROM "favorites" WHERE ("favorites"."id" = 1) LIMIT 1
DELETE FROM "favorites" WHERE ("favorites"."id" = 1)
---
  def destroy
    @favorite = Favorite.find(params[:id])
    @favorite.destroy

SELECT COUNT(*) FROM "favorites" WHERE ("favorites"."idea_id" = 18) AND ("favorites"."user_id" = 1)
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 20) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "favorites" ("idea_id", "user_id", "created_at", "updated_at") VALUES (18, 1, '2011-01-07 17:38:46.898900', '2011-01-07 17:38:46.898900')
---
  def add_my_favorite
    favorites = Favorite.where(:idea_id => params[:idea_id], :user_id => current_user.id)

    go = true

    # check if favorite exists
    if favorites.count > 0
      go = false
    end

    # check if this is the current user
    if Idea.find(params[:idea_id]).user.id == current_user.id
      go = false
    end

    if go == true
      f = Favorite.new
      f.user_id = current_user.id
      f.idea_id = params[:idea_id]
      f.save