app/controllers/ideas_controller.rb

  def show
    @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 0) LIMIT 1

  def edit
    @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 12) LIMIT 1

  def create
    @idea = Idea.new(params[:idea])
    @idea.user_id = current_user.id

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("title", "statement", "summary", "user_id", "created_at", "updated_at") VALUES ('Test', 'test', 'test', NULL, '2011-01-05 00:20:27.779296', '2011-01-05 00:20:27.779296')

  def update
    @idea = Idea.find(params[:id])

    respond_to do |format|
      if @idea.update_attributes(params[:idea])
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 12) LIMIT 1
UPDATE "ideas" SET "title" = 'Drew''s Idea', "statement" = 'This is just a test', "summary" = 'test motha fucka.. bobamba', "updated_at" = '2011-01-05 00:20:48.480480' WHERE ("ideas"."id" = 12)

  def destroy
    @idea = Idea.find(params[:id])

    #kill everything else like subideas and maps
    subideas = Subidea.where(:idea_id => @idea.id)
    subideas.each do |si|
      si.map.destroy
      si.destroy
    end

    @idea.destroy
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 1) LIMIT 1
SELECT "subideas".* FROM "subideas" WHERE ("subideas"."idea_id" = 16)
DELETE FROM "maps" WHERE ("maps"."id" = 13)
SELECT "maps".* FROM "maps" WHERE ("maps".subidea_id = 19) LIMIT 1
DELETE FROM "ideas" WHERE ("ideas"."id" = 1)
DELETE FROM "subideas" WHERE ("subideas"."id" = 13)