app/controllers/maps_controller.rb

SELECT "maps".* FROM "maps"
---
  def index
    @maps = Map.all

SELECT "maps".* FROM "maps" WHERE ("maps"."id" = 1) LIMIT 1
---
  def show
    @map = Map.find(params[:id])

SELECT "maps".* FROM "maps" WHERE ("maps"."id" = 1) LIMIT 1
---
  def edit
    @map = Map.find(params[:id])

INSERT INTO "maps" ("cellw", "cellh", "dir", "ico_type", "subidea_id", "created_at", "updated_at") VALUES ('c', '2', 'n', 2, 1, '2011-01-06 00:12:45.746666', '2011-01-06 00:12:45.746666')
---
  def create
    @map = Map.new(params[:map])

    respond_to do |format|
      if @map.save

SELECT "maps".* FROM "maps" WHERE ("maps"."id" = 1) LIMIT 1
UPDATE "maps" SET "cellw" = '2', "ico_type" = 1, "updated_at" = '2011-01-06 04:12:45.325275' WHERE ("maps"."id" = 31)
---
  def update
    @map = Map.find(params[:id])

    respond_to do |format|
      if @map.update_attributes(params[:map])

SELECT "maps".* FROM "maps" WHERE ("maps"."id" = 3) LIMIT 1
DELETE FROM "maps" WHERE ("maps"."id" = 3)
---
  def destroy
    @map = Map.find(params[:id])
    @map.destroy