app/controllers/milestones_controller.rb

SELECT "milestones".* FROM "milestones"
---
  def index
    @milestones = Milestone.all

SELECT "milestones".* FROM "milestones" WHERE ("milestones"."id" = 1) LIMIT 1
---
  def show
    @milestone = Milestone.find(params[:id])

SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 18) LIMIT 1
---
  def new
    @milestone = Milestone.new
    @idea = Idea.find(params[:idea_id])

SELECT "milestones".* FROM "milestones" WHERE ("milestones"."id" = 1) LIMIT 1
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 18) LIMIT 1
---
  def edit
    @milestone = Milestone.find(params[:id])
    @idea = Idea.find(params[:idea_id])

INSERT INTO "milestones" ("complete", "due", "idea_id", "summary", "created_at", "updated_at") VALUES (0, '2011-01-12 12:00:00.000000', 18, 'Get the Core App built', '2011-01-11 21:48:45.076400', '2011-01-11 21:48:45.076400')
---
  def create
    @milestone = Milestone.new(params[:milestone])

    respond_to do |format|
      if @milestone.save

SELECT "milestones".* FROM "milestones" WHERE ("milestones"."id" = 1) LIMIT 1
UPDATE "milestones" SET "due" = '2011-01-13 18:00:00.000000', "updated_at" = '2011-01-12 02:07:35.891650' WHERE ("milestones"."id" = 1)
---
  def update
    @milestone = Milestone.find(params[:id])

    respond_to do |format|
      if @milestone.update_attributes(params[:milestone])

SELECT "milestones".* FROM "milestones" WHERE ("milestones"."id" = 2) LIMIT 1
DELETE FROM "milestones" WHERE ("milestones"."id" = 2)
---
  def destroy
    @milestone = Milestone.find(params[:id])
    idea_id = @milestone.idea.id
    @milestone.destroy