app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 1) LIMIT 1

  def new
    @question = Question.new
    @idea = Idea.find(params[:idea_id])
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 18) LIMIT 1

  def edit
    @question = Question.find(params[:id])
    @idea = Idea.find(params[:idea_id])
---
SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 4) LIMIT 1
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 4) LIMIT 1

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "answer", "idea_id", "created_at", "updated_at") VALUES ('Test question', NULL, 18, '2011-01-06 23:37:08.871150', '2011-01-06 23:37:08.871150')

  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])
---
SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 1) LIMIT 1
UPDATE "questions" SET "answer" = 'Your question is stupid.', "updated_at" = '2011-01-06 23:58:49.339150' WHERE ("questions"."id" = 1)

  def destroy
    @question = Question.find(params[:id])
    idea_id = @question.idea.id
    @question.destroy
---
SELECT "questions".* FROM "questions" WHERE ("questions"."id" = 3) LIMIT 1
DELETE FROM "questions" WHERE ("questions"."id" = 3)