app/controllers/ratings_controller.rb

  def destroy
    @rating = Rating.find(params[:id])
    @rating.destroy
---
SELECT "ratings".* FROM "ratings" WHERE ("ratings"."id" = 1) LIMIT 1
DELETE FROM "ratings" WHERE ("ratings"."id" = 1)