app/controllers/subideas_controller.rb

  def index
    @subideas = Subidea.all
---
SELECT "subideas".* FROM "subideas"

  def show
    @subidea = Subidea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 12) LIMIT 1
SELECT "subideas".* FROM "subideas" WHERE ("subideas"."id" = 1) LIMIT 1

  def new
    @subidea = Subidea.new

    # parse the extra data
    @p = params[:extra]
    @idea_id = @p[4,255]
    @ico_type = @p[0]
    @cellw = @p[1]
    @cellh = @p[2]
    @dir = @p[3]

    @idea = Idea.find(@idea_id)
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 18) LIMIT 1

  def edit
    @subidea = Subidea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 18) LIMIT 1
SELECT "subideas".* FROM "subideas" WHERE ("subideas"."id" = 1) LIMIT 1

  def create
    @subidea = Subidea.new(params[:subidea])

    respond_to do |format|
      if @subidea.save

        # create map for idea
        map = Map.new
        map.cellw = params[:cellw]
        map.cellh = params[:cellh]
        map.dir = params[:dir]
        map.ico_type = params[:ico_type]
        map.subidea_id = @subidea.id
        map.save
---
INSERT INTO "subideas" ("title", "summary", "idea_id", "created_at", "updated_at") VALUES ('Test Subidea', 'blah blah blah', 12, '2011-01-05 22:58:11.564758', '2011-01-05 22:58:11.564758')
INSERT INTO "maps" ("cellw", "cellh", "dir", "ico_type", "subidea_id", "created_at", "updated_at") VALUES ('2', '2', 'n', 1, 3, '2011-01-06 03:01:00.316042', '2011-01-06 03:01:00.316042')

  def update
    @subidea = Subidea.find(params[:id])

    respond_to do |format|
      if @subidea.update_attributes(params[:subidea])
---
SELECT "subideas".* FROM "subideas" WHERE ("subideas"."id" = 23) LIMIT 1
UPDATE "subideas" SET "title" = 'Idea Map', "summary" = 'The idea map is a way for people to customize their ideas in a visual, simple and elegant manner. The idea map has a free-form structure, yet challenges the user to adopt a predefined idea structure. The top or bottom levels are reserved for simple offshoots of the main idea while the left and right levels are reserved for more complicated ideas that have their own respective offshoots of no more than 3.', "updated_at" = '2011-01-06 03:44:16.426532' WHERE ("subideas"."id" = 23)

  def destroy
    @subidea = Subidea.find(params[:id])
    @subidea.map.destroy

    # kill all the sub subideas
    ssi = Subidea.where(:parent_id => @subidea.id)
---
SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 17) LIMIT 1
SELECT "subideas".* FROM "subideas" WHERE ("subideas"."id" = 3) LIMIT 1
DELETE FROM "maps" WHERE ("maps"."id" = 18)
DELETE FROM "subideas" WHERE ("subideas"."id" = 3)
SELECT "maps".* FROM "maps" WHERE ("maps".subidea_id = 18) LIMIT 1
SELECT "subideas".* FROM "subideas" WHERE ("subideas"."parent_id" = 29)