app/views/subideas/new.html.erb

SELECT "ideas".* FROM "ideas" WHERE ("ideas"."id" = 18) LIMIT 1
---
  <%
  idea = Idea.find(idea_id)